app/controllers/companies_controller.rb

INSERT INTO "companies" ("name", "location", "mail", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Campus Code"], ["location", "São Paulo"], ["mail", "contato@campus.com.br"], ["phone", "2369-3476"], ["created_at", 2017-02-14 00:09:13 UTC], ["updated_at", 2017-02-14 00:09:13 UTC]]
---
  def create
    @company = Company.new(company_params)
    @company.save