app/controllers/jobs_controller.rb

  def index
    @jobs = Job.all
    @companies = Company.all
---
SELECT "companies".* FROM "companies"

  def show
    @companies = Company.find(params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    @categories = Category.all
    @companies = Company.all
---
SELECT "categories".* FROM "categories"
SELECT "companies".* FROM "companies"

  def create
    @categories = Category.all
    @companies = Company.all
---
SELECT "categories".* FROM "categories"
SELECT "companies".* FROM "companies"

  def edit
    @companies = Company.all
    @categories = Category.all
---
SELECT "companies".* FROM "companies"
SELECT "categories".* FROM "categories"

  def update
    @categories = Category.all
    @companies = Company.all
---
SELECT "categories".* FROM "categories"
SELECT "companies".* FROM "companies"